In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
table = pd.DataFrame(np.random.randint(1,100,(5,5)),columns =list('ABCDE'))

In [4]:
table

    A   B   C   D   E
0  48  76  54   5  52
1  11  91  42  48  95
2  57  58  20  62  68
3  27  41   6   8  44
4   5  21  53   8  28

In [5]:
table['F'] = np.random.randint(1,10,5)

In [6]:
table

    A   B   C   D   E  F
0  48  76  54   5  52  1
1  11  91  42  48  95  3
2  57  58  20  62  68  1
3  27  41   6   8  44  1
4   5  21  53   8  28  6

In [7]:
val = ['ba','sd','df','bc','xc']
table.insert(0,'dept',val)

In [8]:
table

  dept   A   B   C   D   E  F
0   ba  48  76  54   5  52  1
1   sd  11  91  42  48  95  3
2   df  57  58  20  62  68  1
3   bc  27  41   6   8  44  1
4   xc   5  21  53   8  28  6

In [9]:
table['dept'].apply(lambda  x:x)

0    ba
1    sd
2    df
3    bc
4    xc
Name: dept, dtype: object

In [10]:
table['dept'].apply(lambda row: 'ayushg'+row)

0    ayushgba
1    ayushgsd
2    ayushgdf
3    ayushgbc
4    ayushgxc
Name: dept, dtype: object

In [11]:
table['F'].apply(lambda val: 1.1*val)

0    1.1
1    3.3
2    1.1
3    1.1
4    6.6
Name: F, dtype: float64

In [12]:
table['F']*1.1

0    1.1
1    3.3
2    1.1
3    1.1
4    6.6
Name: F, dtype: float64

In [13]:
date_data=pd.date_range('01/01/24','01/05/24',freq='d')
table.insert(0,'Datetime',date_data)

In [14]:
table

    Datetime dept   A   B   C   D   E  F
0 2024-01-01   ba  48  76  54   5  52  1
1 2024-01-02   sd  11  91  42  48  95  3
2 2024-01-03   df  57  58  20  62  68  1
3 2024-01-04   bc  27  41   6   8  44  1
4 2024-01-05   xc   5  21  53   8  28  6

In [15]:
table['Datetime'].dt.day

0    1
1    2
2    3
3    4
4    5
Name: Datetime, dtype: int32

In [16]:
def convert_upper(x):
    return x.upper()

In [17]:
table['dept'].apply(convert_upper)

0    BA
1    SD
2    DF
3    BC
4    XC
Name: dept, dtype: object

In [18]:
table2=table.copy()

In [19]:
table2.iloc[:,2:]+100

     A    B    C    D    E    F
0  148  176  154  105  152  101
1  111  191  142  148  195  103
2  157  158  120  162  168  101
3  127  141  106  108  144  101
4  105  121  153  108  128  106

In [20]:
table2.iloc[:,2:] = table2.iloc[:,2:]+100

In [21]:
table2

    Datetime dept    A    B    C    D    E    F
0 2024-01-01   ba  148  176  154  105  152  101
1 2024-01-02   sd  111  191  142  148  195  103
2 2024-01-03   df  157  158  120  162  168  101
3 2024-01-04   bc  127  141  106  108  144  101
4 2024-01-05   xc  105  121  153  108  128  106

In [22]:
table2['Datetime'] = pd.date_range('02/01/24','02/05/24',freq='d')

In [23]:
table2

    Datetime dept    A    B    C    D    E    F
0 2024-02-01   ba  148  176  154  105  152  101
1 2024-02-02   sd  111  191  142  148  195  103
2 2024-02-03   df  157  158  120  162  168  101
3 2024-02-04   bc  127  141  106  108  144  101
4 2024-02-05   xc  105  121  153  108  128  106

In [24]:
pd.concat([table,table2],axis =1)

,Datetime,dept,A,B,C,D,E,F,Datetime,dept,A,B,C,D,E,F
0,2024-01-01,ba,48,76,54,5,52,1,2024-02-01,ba,148,176,154,105,152,101
1,2024-01-02,sd,11,91,42,48,95,3,2024-02-02,sd,111,191,142,148,195,103
2,2024-01-03,df,57,58,20,62,68,1,2024-02-03,df,157,158,120,162,168,101
3,2024-01-04,bc,27,41,6,8,44,1,2024-02-04,bc,127,141,106,108,144,101
4,2024-01-05,xc,5,21,53,8,28,6,2024-02-05,xc,105,121,153,108,128,106

In [25]:
final_data = pd.concat([table,table2],ignore_index = True)

In [26]:
final_data

    Datetime dept    A    B    C    D    E    F
0 2024-01-01   ba   48   76   54    5   52    1
1 2024-01-02   sd   11   91   42   48   95    3
2 2024-01-03   df   57   58   20   62   68    1
3 2024-01-04   bc   27   41    6    8   44    1
4 2024-01-05   xc    5   21   53    8   28    6
5 2024-02-01   ba  148  176  154  105  152  101
6 2024-02-02   sd  111  191  142  148  195  103
7 2024-02-03   df  157  158  120  162  168  101
8 2024-02-04   bc  127  141  106  108  144  101
9 2024-02-05   xc  105  121  153  108  128  106

In [27]:
print(table,end='\n'*3)
print(table2)

    Datetime dept   A   B   C   D   E  F
0 2024-01-01   ba  48  76  54   5  52  1
1 2024-01-02   sd  11  91  42  48  95  3
2 2024-01-03   df  57  58  20  62  68  1
3 2024-01-04   bc  27  41   6   8  44  1
4 2024-01-05   xc   5  21  53   8  28  6


    Datetime dept    A    B    C    D    E    F
0 2024-02-01   ba  148  176  154  105  152  101
1 2024-02-02   sd  111  191  142  148  195  103
2 2024-02-03   df  157  158  120  162  168  101
3 2024-02-04   bc  127  141  106  108  144  101
4 2024-02-05   xc  105  121  153  108  128  106

In [28]:
display(table)
display(table2)

    Datetime dept   A   B   C   D   E  F
0 2024-01-01   ba  48  76  54   5  52  1
1 2024-01-02   sd  11  91  42  48  95  3
2 2024-01-03   df  57  58  20  62  68  1
3 2024-01-04   bc  27  41   6   8  44  1
4 2024-01-05   xc   5  21  53   8  28  6

    Datetime dept    A    B    C    D    E    F
0 2024-02-01   ba  148  176  154  105  152  101
1 2024-02-02   sd  111  191  142  148  195  103
2 2024-02-03   df  157  158  120  162  168  101
3 2024-02-04   bc  127  141  106  108  144  101
4 2024-02-05   xc  105  121  153  108  128  106

In [29]:
data1 = pd.Series([12,3543,576,676],name='salary')
data2= pd.Series(np.random.randint(1,1000,4),name = 'salary')

In [30]:
data1

0      12
1    3543
2     576
3     676
Name: salary, dtype: int64

In [31]:
data2

0    845
1    169
2    592
3    236
Name: salary, dtype: int32

In [32]:
pd.DataFrame(data1)

   salary
0      12
1    3543
2     576
3     676

In [33]:
data1 = {'eid':np.arange(1,11),
         'sales':np.random.randint(30000,70000,10)}
data2 = {'eid':np.arange(1,11),
         'sales':np.random.randint(0,10000,10)}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [34]:
df1

   eid  sales
0    1  61460
1    2  44208
2    3  55032
3    4  31735
4    5  37471
5    6  52568
6    7  61252
7    8  30738
8    9  39701
9   10  46237

In [35]:
df2

   eid  sales
0    1   9893
1    2   4758
2    3   2086
3    4   5130
4    5   5184
5    6   1961
6    7   7649
7    8   1022
8    9   2990
9   10   1350

In [38]:
flights_df.plot(kind='line',x = 'month',y = 'passengers')

NameError: name 'flights_df' is not defined